<a href="https://colab.research.google.com/github/feulo-ocean/python-sql/blob/main/python_sql.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Banco de Dados

* Componentes
  * Base de dados
  * Sistema Gerenciador de Bando de Dados (SGDB)
  * Linguagem de Manipulação
    *  Structered Query Language (SQL)
  * Programas adicionais

* Arquitetura
  * Cliente-Servidor

## Modelo Relacional
  
| nome | tipo | level | capturado em|
|---- |----|-----|----|
|Pikachu| Elétrico| 5| 08 jun 2021|
|Bulbassauro| Grama| 10| 10 fev 1990|
|Squirtle| Água| 12| 23 out 2015|

Tabela ou Relação

Linhas, Intâncias, Entradas, Registros, Tupla

Colunas, atributos, características

## Implementação em SQL

* dialetos: MySQL, PostreSQL, MariaDB, Oracle etc

* MySQL online: https://paiza.io/en/projects/new?language=mysql
* PostgreSQL as a Service: https://www.elephantsql.com/
* Sqlite e PostgreSQL: https://sqliteonline.com/

#### Criando um banco de dados dentro do SGDB
* MySQL
      CREATE DATABASE [IF NOT EXISTS] db_name
*PostgreSQL
      CREATE DATABASE name
*SQLite
      # Não tem (nesse formato)

### Linguagem de Descrição de Dados (DDL)


#### CREATE (Criar)
      CREATE [TEMPORARY] TABLE [IF NOT EXISTS] tbl_name
      [column_name column_type column_constraint, ...]
      [table_constraints, ...]

[MySQL types](https://dev.mysql.com/doc/refman/8.0/en/data-types.html) 
\- [PostrgreSQL types](https://www.postgresql.org/docs/9.5/datatype.html)
\- [SQLite types](https://www.sqlite.org/datatype3.html)

* Most used Constraints:

#### ALTER (alterar)
      ALTER TABLE tbl_name [alter_option, ...]

#### DROP (descartar)
      DROP TABLE [ IF EXISTS ] tbl_name [, ...]

### Linguagem de Manipulação de Dados (DML)


#### INSERT (inserir)

      INSERT  INTO tbl_name[(col_name [, col_name] ...)]
      VALUES (value_list) [, (value_list)] ...```


#### UPDATE (atualizar)
      UPDATE table_reference
      SET assignment_list
      [WHERE where_condition]

#### DELETE (deletar) 
      DELETE FROM tbl_name [WHERE where_condition]

### Linguagem de Consulta de Dados (DQL)


#### SELECT (SELECIONAR)

      SELECT [ALL | ISTINCT | DISTINCTROW ]
      select_expr [, select_expr] ...
      [FROM table_references
      [WHERE where_condition]
      [GROUP BY {col_name | expr | position}, ...]
      [HAVING where_condition]
      [ORDER BY {col_name | expr | position} [ASC | DESC], ...]
      [LIMIT {[offset,] row_count | row_count OFFSET offset}]

#### JOINS

### Linguagem de Transação de Dados (DTL)
### Linguagem de Controle de Dados (DCL)

# Integração com Python

In [1]:
import sqlite3

In [3]:
con = sqlite3.connect("banco_teste.db")

In [8]:
con.execute("""CREATE TABLE Pokemons(
  id INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL,
  nome VARCHAR(20)
  )""")

In [9]:
con.execute("INSERT INTO Pokemons(nome) VALUES ('Pikachu')")

In [10]:
rs = con.execute("SELECT * FROM Pokemons")

In [11]:
list(rs)

[(1, 'Pikachu')]

## SQLAlchemy

É um *framework* desenvolvido para permitir programar aplicações que usem Banco de dados, de maneira inpedepende e com diferentes tipos de abstração:

* Raw SQL (SQL Bruto)
* SQL Expression Language (Linguagem de Expressão SQL)
* Object-Relational Mapping - ORM (Mapeamento Objeto-Relacional)

### Raw SQL

In [13]:
from sqlalchemy import create_engine
from sqlalchemy.sql import text

In [50]:
# Cria a engine para o banco de dados
eng = create_engine("sqlite:///cars.db")
eng_postgres = create_engine("postgresql://joomtyly:as6LBeTxT-9VwhLLHKaLLonMYDTqNLGz@raja.db.elephantsql.com/joomtyly")

In [30]:
# abre uma conexão com o banco e executa código SQL
with eng.connect() as con:
  con.execute(text('DROP TABLE IF EXISTS Cars'))
  con.execute(text('''CREATE TABLE Cars(Id INTEGER PRIMARY KEY, 
                   Name TEXT, Price INTEGER)'''))

In [34]:
with eng.connect() as con:
  con.execute(text("INSERT INTO Cars(Id, Name, Price) VALUES (10, 'belina', 1500)"))

In [32]:
data = [{ "Id": 1, "Name": "Audi", "Price": 52642 },
        { "Id": 2, "Name": "Mercedes", "Price": 57127 },
        { "Id": 3, "Name": "Skoda", "Price": 9000 },
        { "Id": 4, "Name": "Volvo", "Price": 29000 },
        { "Id": 5, "Name": "Bentley", "Price": 350000 },
        { "Id": 6, "Name": "Citroen", "Price": 21000 },
        { "Id": 7, "Name": "Hummer", "Price": 41400 },
        { "Id": 8, "Name": "Volkswagen", "Price": 21600 }
]
# Inserindo dados
with eng.connect() as con:
  for line in data:
    con.execute(text("""INSERT INTO Cars(Id, Name, Price) VALUES(:Id, :Name, :Price)"""), **line)

In [37]:
# Recebendo dados
with eng.connect() as con:
  rs = con.execute(text("SELECT * FROM Cars"))
  #print(rs.fetchone())
  #print(rs.fetchmany(3))
  print(rs.fetchall())

[(1, 'Audi', 52642), (2, 'Mercedes', 57127), (3, 'Skoda', 9000), (4, 'Volvo', 29000), (5, 'Bentley', 350000), (6, 'Citroen', 21000), (7, 'Hummer', 41400), (8, 'Volkswagen', 21600), (9, 'Fusca', 1000)]

### SQL Expression Language

#### Definição de Schemas

In [38]:
from sqlalchemy import Table, Column, Integer, String, MetaData

In [40]:
# Cria um ojeto de metadata. Metadatas são coleçoes de tabelas e sua infos
meta = MetaData()

In [41]:
#Cria um objeto do tipo tabela que abstrai uma tabela no Banco de dados
cars = Table('Cars', meta,
     Column('Id', Integer, primary_key=True),
     Column('Name', String),
     Column('Price', Integer)
)

In [42]:
print("The Name column:")
print(cars.columns.Name)
print(cars.c.Name)

print("Columns: ")
for col in cars.c:
    print(col)
    
print("Primary keys:")
for pk in cars.primary_key:
    print(pk)    

print("The Id column:")
print(cars.c.Id.name)
print(cars.c.Id.type)
print(cars.c.Id.nullable)
print(cars.c.Id.primary_key)

The Name column:
Cars.Name
Cars.Name
Columns:
Cars.Id
Cars.Name
Cars.Price
Primary keys:
Cars.Id
The Id column:
Id
INTEGER
False
True

In [43]:
meta.reflect(bind=eng)
for table in meta.tables:
    print(table)

Cars

In [44]:
from sqlalchemy import inspect

In [45]:
insp = inspect(eng)
print(insp.get_table_names())
print(insp.get_columns("Cars"))
print(insp.get_pk_constraint("Cars"))

['Cars']
[{'name': 'Id', 'type': INTEGER(), 'nullable': True, 'default': None, 'autoincrement': 'auto', 'primary_key': 1}, {'name': 'Name', 'type': TEXT(), 'nullable': True, 'default': None, 'autoincrement': 'auto', 'primary_key': 0}, {'name': 'Price', 'type': INTEGER(), 'nullable': True, 'default': None, 'autoincrement': 'auto', 'primary_key': 0}]
{'constrained_columns': ['Id'], 'name': None}

INSERT INTO "Cars" ("Id", "Name", "Price") VALUES (:Id_m0, :Name_m0, :Price_m0)

#### Expression Language

In [46]:
from sqlalchemy.sql import select

In [56]:
meta2 = MetaData(eng_postgres)
meta2.reflect(bind=eng_postgres)
cars_postgres = Table('cars', meta2, autoload=True)

In [80]:
with eng.connect() as con:
  stm = cars.insert(values=[(11, 'Escort', 2000)])
  con.execute(stm)

In [83]:
print(stm)

SELECT cars.id, cars.name, cars.price
FROM cars

In [81]:
# SELECT
with eng.connect() as con:
  stm = select([cars])
  rs = con.execute(stm) 
  print(rs.fetchall())

[(1, 'Audi', 52642), (2, 'Mercedes', 57127), (3, 'Skoda', 9000), (4, 'Volvo', 29000), (5, 'Bentley', 350000), (6, 'Citroen', 21000), (7, 'Hummer', 41400), (8, 'Volkswagen', 21600), (9, 'Fusca', 1000), (11, 'Escort', 2000)]

In [49]:
print(stm)

SELECT "Cars"."Id", "Cars"."Name", "Cars"."Price"
FROM "Cars"

In [66]:
# LIMIT
with eng.connect() as con:
  stm = select([cars.c.Name, cars.c.Price]).limit(3)
  rs = con.execute(stm) 
  print(rs.fetchall())

[('Audi', 52642), ('Mercedes', 57127), ('Skoda', 9000)]

In [67]:
print(stm)

SELECT "Cars"."Name", "Cars"."Price"
FROM "Cars"
 LIMIT :param_1

In [68]:
from sqlalchemy.sql import and_, or_

In [69]:
# WHERE
with eng.connect() as con:
  stm = select([cars]).where(and_(cars.c.Price > 10000, cars.c.Price < 40000))
  rs = con.execute(stm) 
  print(rs.fetchall())

[(4, 'Volvo', 29000), (6, 'Citroen', 21000), (8, 'Volkswagen', 21600)]

In [70]:
print(stm)

SELECT "Cars"."Id", "Cars"."Name", "Cars"."Price"
FROM "Cars"
WHERE "Cars"."Price" > :Price_1 AND "Cars"."Price" < :Price_2

In [71]:
#LIKE
with eng.connect() as con:
  stm = select([cars]).where(cars.c.Name.like('%en'))
  rs = con.execute(stm) 
  print(rs.fetchall())

[(6, 'Citroen', 21000), (8, 'Volkswagen', 21600)]

In [72]:
from sqlalchemy.sql import asc, desc

In [73]:
# Order By
with eng.connect() as con:  
  s = select([cars]).order_by(asc(cars.c.Name))
  rs = con.execute(s) 
  for row in rs:
    print(row['Id'], row['Name'], row['Price'])

1 Audi 52642
5 Bentley 350000
6 Citroen 21000
9 Fusca 1000
7 Hummer 41400
2 Mercedes 57127
3 Skoda 9000
8 Volkswagen 21600
4 Volvo 29000

In [ ]:

# ler dos arquivos
with eng.connect() as con:
  authors = Table('Authors', meta, autoload=True)
  books = Table('Books', meta, autoload=True)
  stm = select([authors.join(books)])
  rs = con.execute(stm) 
  for row in rs:
    print row['Name'], row['Title']

### Object-Relational Mapping (ORM)

In [107]:
from sqlalchemy.ext.declarative import declarative_base
from sqlalchemy import Column, Integer, String
from sqlalchemy.orm import sessionmaker
from sqlalchemy.exc import IntegrityError

In [130]:
# Classes Bases e Sessão
Base = declarative_base(bind=eng)
Session = sessionmaker(bind=eng)

In [103]:
class Car(Base):
  __tablename__ = "Cars"

  id = Column(Integer, primary_key=True, autoincrement=True)
  name = Column(String, unique=True, index=True)  
  price = Column(Integer, nullable=False)

  def __repr__(self):
    return f"<Car: {self.name}>"

In [109]:
Base.metadata.create_all()        
ses = Session()

In [110]:
try: 
  ses.add(Car(name='Audi', price=52642))
  ses.commit()
except IntegrityError:
  print("Ja existe um carro com esse nome")
  ses.rollback()
ses.close()

Ja existe um carro com esse nome

In [111]:
with Session() as s:
  s.add_all([ 
    Car(name='Mercedes', price=57127),
    Car(name='Skoda', price=9000),
    Car(name='Volvo', price=29000),
    Car(name='Bentley', price=350000),
    Car(name='Citroen', price=21000),
    Car(name='Hummer', price=41400),
    Car(name='Volkswagen', price=21600)
  ])
  s.commit()

In [112]:
# Fazendo a query
with Session() as s:
  rs = s.query(Car).all()
  for car in rs:
    print(car.name, car.price)

Audi 52642
Mercedes 57127
Skoda 9000
Volvo 29000
Bentley 350000
Citroen 21000
Hummer 41400
Volkswagen 21600

In [115]:
with Session() as s:
  rs = s.query(Car).filter(Car.price >10000).limit(2)
  for car in rs:
    print(car.name, car.price)

Audi 52642
Mercedes 57127

In [116]:
from sqlalchemy import ForeignKey
from sqlalchemy.orm import relationship

In [131]:
class Author(Base):
  __tablename__ = "Authors"
 
  author_id = Column(Integer, primary_key=True, autoincrement=True)
  name = Column(String)  
  books = relationship("Book")

  def __init__(self, name):
    self.name = name

  def __repr__(self):
    return f"<Author: {self.name}>"

class Book(Base):
  __tablename__ = "Books"
 
  book_id = Column(Integer, primary_key=True, autoincrement=True)
  title = Column(String)      
  author_id = Column(Integer, ForeignKey("Authors.author_id"))    
  author = relationship("Author")

  def __init__(self, title, author_id):
    self.title = title
    self.author_id = author_id 

  def __repr__(self):
    return f"<Book: {self.title} - {self.author.name}>"

In [122]:
Base.metadata.create_all()

In [126]:
with Session() as s:
  s.add_all([ 
    Author('Jane Austen'),
    Author('Leo Tolstoy'),
    Author('Joseph Heller'),
    Author('Charles Dickens'),
    Book('Emma',1),
    Book('War and Peace',2),
    Book('Catch XII',3),
    Book('David Copperfield',4),
    Book('Good as Gold',3),
    Book('Anna Karenia',2)
  ])
  s.commit()

In [127]:
with Session() as s:
  res = s.query(Author).all()
  print(res)

[<Author: Jane Austen>, <Author: Leo Tolstoy>, <Author: Joseph Heller>, <Author: Charles Dickens>]

In [132]:
with Session() as s:
  res = s.query(Book).all()
  print(res)

[<Book: Emma - Jane Austen>, <Book: War and Peace - Leo Tolstoy>, <Book: Catch XII - Joseph Heller>, <Book: David Copperfield - Charles Dickens>, <Book: Good as Gold - Joseph Heller>, <Book: Anna Karenia - Leo Tolstoy>]

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:2: SAWarning: relationship 'Book.author' will copy column Authors.author_id to column Books.author_id, which conflicts with relationship(s): 'Author.books' (copies Authors.author_id to Books.author_id). If this is not the intention, consider if these relationships should be linked with back_populates, or if viewonly=True should be applied to one or more if they are read-only. For the less common case that foreign key constraints are partially overlapping, the orm.foreign() annotation can be used to isolate the columns that should be written towards.   The 'overlaps' parameter may be used to remove this warning.

In [135]:
with Session() as s:
  res = s.query(Author).filter(Author.name=="Leo Tolstoy").first()
  print(res.name)
  for book in res.books:
    print (book.title)

Leo Tolstoy
War and Peace
Anna Karenia

In [138]:
with Session() as s:
  res = s.query(Book).filter(Book.title=="Emma").first()
  print(res.author.name)

Jane Austen